In [1]:
import numpy as np
import pandas as pd

# Arithmetic and Data Alignment

## Summarizing and Computing Descriptive Statistics

Unlike NumPy arrays, Pandas descriptive statistics automatically exclude missing data.  NaN values are excluded unless the entire row or column is NA.

In [3]:
df1 = pd.DataFrame( np.random.randn(10, 3),
                  columns=['a', 'b', 'c'])

df1

          a         b         c
0 -0.217930 -1.987477  0.266556
1  2.265465  0.914885 -0.862443
2  1.616129 -1.295283  0.885437
3  0.432673 -0.483316 -0.787804
4  0.684649 -0.085879  0.532726
5  0.241696  0.782126 -0.447970
6  2.345735  1.169313 -0.448716
7  0.047316  1.527817  1.442229
8  1.143367  0.898275  1.245041
9 -0.025585  0.372686 -1.073423

In [5]:
df1['cat1'] = (np.random.rand(10) * 3).round(0)
df1['cat2'] = (np.random.rand(10)).round(0)
df1

          a         b         c  cat1  cat2
0 -0.217930 -1.987477  0.266556   1.0   1.0
1  2.265465  0.914885 -0.862443   1.0   0.0
2  1.616129 -1.295283  0.885437   1.0   0.0
3  0.432673 -0.483316 -0.787804   3.0   0.0
4  0.684649 -0.085879  0.532726   1.0   1.0
5  0.241696  0.782126 -0.447970   2.0   0.0
6  2.345735  1.169313 -0.448716   2.0   1.0
7  0.047316  1.527817  1.442229   2.0   1.0
8  1.143367  0.898275  1.245041   1.0   0.0
9 -0.025585  0.372686 -1.073423   3.0   0.0

### Sum and Mean

In [15]:
df1.loc[6,'a'] = np.nan
df1

          a         b         c  cat1  cat2
0 -0.217930 -1.987477  0.266556   1.0   1.0
1  2.265465  0.914885 -0.862443   1.0   0.0
2  1.616129 -1.295283  0.885437   1.0   0.0
3  0.432673 -0.483316 -0.787804   3.0   0.0
4  0.684649 -0.085879  0.532726   1.0   1.0
5  0.241696  0.782126 -0.447970   2.0   0.0
6       NaN  1.169313 -0.448716   2.0   1.0
7  0.047316  1.527817  1.442229   2.0   1.0
8  1.143367  0.898275  1.245041   1.0   0.0
9 -0.025585  0.372686 -1.073423   3.0   0.0

In [16]:
df1.sum()

a        6.187781
b        1.813146
c        0.751633
cat1    17.000000
cat2     4.000000
dtype: float64

In [17]:
df1.sum(axis=1)

0    0.061150
1    3.317907
2    2.206283
3    2.161553
4    3.131497
5    2.575851
6    3.720597
7    6.017361
8    4.286682
9    2.273679
dtype: float64

In [18]:
df1.mean(axis=0)

a       0.687531
b       0.181315
c       0.075163
cat1    1.700000
cat2    0.400000
dtype: float64

### Max and max location

In [19]:
df1.max()

a       2.265465
b       1.527817
c       1.442229
cat1    3.000000
cat2    1.000000
dtype: float64

In [23]:
df1.idxmax()

a       1
b       7
c       7
cat1    3
cat2    0
dtype: int64

### Descriptive analysis

In [24]:
df1['a'].describe()

count    9.000000
mean     0.687531
std      0.833813
min     -0.217930
25%      0.047316
50%      0.432673
75%      1.143367
max      2.265465
Name: a, dtype: float64

In [26]:
df1

          a         b         c  cat1  cat2
0 -0.217930 -1.987477  0.266556   1.0   1.0
1  2.265465  0.914885 -0.862443   1.0   0.0
2  1.616129 -1.295283  0.885437   1.0   0.0
3  0.432673 -0.483316 -0.787804   3.0   0.0
4  0.684649 -0.085879  0.532726   1.0   1.0
5  0.241696  0.782126 -0.447970   2.0   0.0
6       NaN  1.169313 -0.448716   2.0   1.0
7  0.047316  1.527817  1.442229   2.0   1.0
8  1.143367  0.898275  1.245041   1.0   0.0
9 -0.025585  0.372686 -1.073423   3.0   0.0

In [25]:
df1['cat1'].value_counts()

1.0    5
2.0    3
3.0    2
Name: cat1, dtype: int64

## Pivot tables

Group by cat1 and calculate mean

In [29]:
df1

          a         b         c  cat1  cat2
0 -0.217930 -1.987477  0.266556   1.0   1.0
1  2.265465  0.914885 -0.862443   1.0   0.0
2  1.616129 -1.295283  0.885437   1.0   0.0
3  0.432673 -0.483316 -0.787804   3.0   0.0
4  0.684649 -0.085879  0.532726   1.0   1.0
5  0.241696  0.782126 -0.447970   2.0   0.0
6       NaN  1.169313 -0.448716   2.0   1.0
7  0.047316  1.527817  1.442229   2.0   1.0
8  1.143367  0.898275  1.245041   1.0   0.0
9 -0.025585  0.372686 -1.073423   3.0   0.0

In [27]:
pd.pivot_table(df1, index='cat1', aggfunc=np.mean)

             a         b         c      cat2
cat1
1.0   1.098336 -0.311096  0.413463  0.400000
2.0   0.144506  1.159752  0.181847  0.666667
3.0   0.203544 -0.055315 -0.930613  0.000000

### group by cat1 and cat2 calculate the sum of b

In [30]:
pd.pivot_table(df1, index='cat1', columns='cat2', values='b', aggfunc=np.sum)

cat2       0.0       1.0
cat1
1.0   0.517876 -2.073355
2.0   0.782126  2.697129
3.0  -0.110630       NaN